[
  {
    "Position": 1,
    "Conteúdo": "Viva Caio, já estavas fazendo falta. Obrigado por mais esse vídeo. Valeu mesmo!",
    "Likes": 3,
    "Replies": 1
  },
  {
    "Position": 2,
    "Conteúdo": "No JavaScript tem o React Native tbm que é um dos frameworks mais usados (se não o usado) no desenvolvimento mobile",
    "Likes": 2,
    "Replies": 1
  },
  {
    "Position": 3,
    "Conteúdo": "Parabéns pelos vídeos!",
    "Likes": 1,
    "Replies": 0
  },
  {
    "Position": 4,
    "Conteúdo": "Eu acho que o problema de JS para iniciantes nao eh nem ser tao permissiva, python tbm eh, mas o problema eh que a linguagem depende muito do contexto (no browser tu tem as web apis do browser, mas se tu for pra nodeJS tu vai ter outras APIs) e tambem houve mudanças muito significativas em seu desenvolvimento. Por exemplo, orientada a objeto em ES5- tu faz atraves da prototype chain, oq eh um pouco ruim de trabalhar (e tbm nao eh padronizado, em um lugar tu acessa por __proto__ outros por proto e outros por getPrototype()), mas em ES6 tu ja tem a sintaxe de classes, soh que em ES6 tu tem muito mais coisas junto, entao a carga de estudo eh maior para tu ter acesso as features da linguagem que sao faceis de trabalhar.\nO event loop tbm eh uma outra caracteristica que dificulta bastante, até mesmo pessoas que trabalham com JS diariamente nao sabem muito bem como o event loop funciona",
    "Likes": 1,
    "Replies": 1
  },
  {
    "Position": 5,
    "Conteúdo": "*EM PLENO 2020,DENO,NOVA REVOLUÇÃO,DART E FLUTTER MUITO FACIL OTIMIZADO E RAPIDO,ALGUÉM: JAVASCRIPT É UMA BOA LANG PRA COMEÇAR ?,\"EI MANO TO SÓ ZOANDO KAKAKKA LEVA NA BRINCA,ENOIS KKKKKK(SEI QUE TODO MUNDO COMEÇA EM ALGO,NINGUEM NASCE SABENDO AKKAKA)*",
    "Likes": 1,
    "Replies": 2
  },
  {
    "Position": 6,
    "Conteúdo": "eu to começando a aprender a programar com Java, fiz certo?",
    "Likes": 2,
    "Replies": 3
  },
  {
    "Position": 7,
    "Conteúdo": "Acho q python não é a melhor  linguagem para começar,  pq ela vem de outras linguagens ex: Sempre q alguém vai fazer alguma coisa em python ele se refere a outra linguagem, falando: Na linguagem x é assim e assado é assim q acontece é assim q faz. Ou seja, isso é muito chato, e eu acho q pode dificultar a aprender a lógica de programação pq muita coisa já vem pronto pq veio de outras linguagens, acho q python é boa linguagem se vc já sabe programar em linguagens como C, C++ ou JAVA.",
    "Likes": 1,
    "Replies": 1
  },
  {
    "Position": 8,
    "Conteúdo": "Até eu que já fiz um ano da faculdade de computação, não sei como começar. Só sei criar algoritmos em C, mas agora não sei o que aprender pra conseguir um emprego como programador. Alias, sei nem qual área da programação quero chegar.",
    "Likes": 1,
    "Replies": 1
  }
]